{
  "0": {
    "id": 1,
    "title": "Mamaearth and Femina present Beautiful Indians Season 3",
    "news": "Mamaearth and Femina presented the season 3 of Beautiful Indians, aiming to celebrate individuals whose goodness has inspired us by bringing a positive change in the society. Individuals, celebrities and content creators were honoured at the event, including Madhuri Dixit, Shraddha Kapoor, Karisma Kapoor, Kartik Aaryan, Shilpa Shetty, Manish Malhotra, Orry, among others.",
    "source": "Mamaearth",
    "sourceURL": "https://www.google.com",
    "imageURL": "https://nis-gs.pix.in/inshorts/images/v1/variants/webp/xs/2024/03_mar/21_thu/img_1711026257848_725.webp?",
    "publishDate": "8.31 am on Friday, 22 March, 2024"
  },
  "1": {
    "id": 2,
    "title": "1st pic shows Arvind Kejriwal after his arrest",
    "news": "First picture showing Delhi Chief Minister Arvind Kejriwal after his arrest by the Enforcement Directorate has been shared by news agency ANI. Kejriwal was arrested from his residence on Thursday in the excise policy case. Meanwhile, the Delhi Police detained AAP workers protesting outside the Delhi CM's residence.",
    "source": "ANI",
    "sourceURL": "https://www.google.com",
    "imageURL": "https://nis-gs.pix.in/inshorts/images/v1/variants/webp/xs/2024/03_mar/21_thu/img_1711044868440_238.webp?",
    "publishDate": "12:23 am on Friday, 22 March, 2024"
  },
  "2": {
    "id": 3,
    "title": "Why has ED arrested Delhi CM Arvind Kejriwal?",
    "news": "ED has arrested Delhi CM Arvind Kejriwal in connection with money laundering probe linked to Delhi liquor excise policy after the leader skipped nine summons. ED had called Kejriwal a \"conspirator\" in the case. It alleged that BRS leader K Kavitha conspired with Kejriwal and AAP leaders while framing the now-scrapped policy, with AAP leaders receiving ₹100 crore in kickbacks.",
    "source": "Mamaearth",
    "sourceURL": "https://www.google.com",
    "imageURL": "https://nis-gs.pix.in/inshorts/images/v1/variants/webp/xs/2024/03_mar/21_thu/img_1711026257848_725.webp?",
    "publishDate": "10:22 pm on Thursday, 21 March, 2024"
  },
  "3": {
    "id": 4,
    "title": "India will launch first human spaceflight by Dec 2024: ISRO chief",
    "news": "ISRO Chairman S Somanath has said that India will launch its first human spaceflight by December 2024. He added that four astronauts have been selected for the mission, and they will be trained in Russia for the flight. The mission will include a crewed spacecraft that will orbit the Earth at an altitude of around 400 km.",
    "source": "ISRO",
    "sourceURL": "https://www.isro.gov.in/",
    "imageURL": "https://example.com/image4.jpg",
    "publishDate": "11:45 am on Wednesday, 20 March, 2024"
  },
  "4": {
    "id": 5,
    "title": "India ranks 86th on global corruption index, drops 7 spots",
    "news": "India has been ranked 86th on the global corruption index, dropping seven spots from last year's ranking. The index, published by Transparency International, ranks 180 countries and territories by their perceived levels of public sector corruption. Denmark and New Zealand topped the list as the least corrupt countries.",
    "source": "Transparency International",
    "sourceURL": "https://www.transparency.org/en/cpi/2023/index/nzl",
    "imageURL": "https://example.com/image5.jpg",
    "publishDate": "2:15 pm on Tuesday, 19 March, 2024"
  },
  "5": {
    "id": 6,
    "title": "Google fined $2.8 billion for abusing online advertising dominance",
    "news": "Google has been fined $2.8 billion by the European Union for abusing its dominant position in online advertising. The EU's competition watchdog found that Google unfairly favoured its own online advertising technology services over competitors. It's the largest antitrust fine ever imposed on a single company by the EU.",
    "source": "European Union",
    "sourceURL": "https://ec.europa.eu/commission/presscorner/detail/en/IP_24_3347",
    "imageURL": "https://example.com/image6.jpg",
    "publishDate": "9:30 am on Monday, 18 March, 2024"
  },
  "6": {
    "id": 7,
    "title": "Facebook to shut down its facial recognition system",
    "news": "Facebook has announced that it will shut down its facial recognition system, which automatically identifies people in photos and videos, starting from October. Facebook said it's doing this to prioritize privacy and give users more control over their data. The move comes amid increasing scrutiny over facial recognition technology.",
    "source": "Facebook",
    "sourceURL": "https://about.fb.com/news/2024/03/changes-to-face-recognition/",
    "imageURL": "https://example.com/image7.jpg",
    "publishDate": "6:00 pm on Sunday, 17 March, 2024"
  },
  "7": {
    "id": 8,
    "title": "Tesla unveils its 'Giga Press' for Model Y production",
    "news": "Tesla has unveiled its 'Giga Press', a massive casting machine used for manufacturing large parts of its electric vehicles, at its Gigafactory in Berlin. The machine is used to cast the rear body of the Model Y electric SUV in a single piece, reducing manufacturing complexity and improving structural integrity.",
    "source": "Tesla",
    "sourceURL": "https://www.tesla.com/updates/model-y-manufacturing",
    "imageURL": "https://example.com/image8.jpg",
    "publishDate": "10:00 am on Saturday, 16 March, 2024"
  },
  "8": {
    "id": 9,
    "title": "Amazon acquires MGM Studios for $8.45 billion",
    "news": "Amazon has acquired MGM Studios, the iconic film and television studio behind franchises like James Bond and Rocky, for $8.45 billion. The deal will give Amazon access to MGM's vast library of content, which includes over 4,000 films and 17,000 TV shows, as it looks to bolster its streaming service, Prime Video.",
    "source": "Amazon",
    "sourceURL": "https://press.aboutamazon.com/news-releases/news-release-details/amazoncom-announces-thegreenlighting-of-its-new-original-dramatic-and-comedy",
    "imageURL": "https://example.com/image9.jpg",
    "publishDate": "3:30 pm on Friday, 15 March, 2024"
  },
  "9": {
    "id": 10,
    "title": "NASA's Artemis I mission launch delayed to mid-2025",
    "news": "NASA has announced that the launch of its Artemis I mission, the first uncrewed test flight of the Space Launch System (SLS) and the Orion spacecraft, has been delayed to mid-2025. The mission was originally scheduled for November 2021 but has faced numerous delays due to technical challenges.",
    "source": "NASA",
    "sourceURL": "https://www.nasa.gov/press-release/artemis-i-mission-update/",
    "imageURL": "https://example.com/image10.jpg",
    "publishDate": "1:00 pm on Thursday, 14 March, 2024"
  },
  "10": {
    "id": 11,
    "title": "Bitcoin surpasses $100,000 for the first time",
    "news": "Bitcoin has surpassed $100,000 for the first time in its history, reaching a new all-time high. The cryptocurrency's price surged over 10% in a single day, driven by increased institutional interest and growing adoption. Bitcoin's market capitalization now exceeds $2 trillion.",
    "source": "Cryptocurrency News",
    "sourceURL": "https://www.coindesk.com/markets/2024/03/13/bitcoin-surpasses-100k-for-the-first-time/",
    "imageURL": "https://example.com/image11.jpg",
    "publishDate": "9:45 am on Wednesday, 13 March, 2024"
  },
  "11": {
    "id": 12,
    "title": "Elon Musk becomes world's richest person again",
    "news": "Elon Musk has reclaimed the title of the world's richest person, surpassing Amazon founder Jeff Bezos once again. Musk's net worth surged to over $330 billion, driven by the soaring value of Tesla shares. He previously held the title briefly in 2021 before being surpassed by Bezos.",
    "source": "Forbes",
    "sourceURL": "https://www.forbes.com/profile/elon-musk/",
    "imageURL": "https://example.com/image12.jpg",
    "publishDate": "12:00 pm on Tuesday, 12 March, 2024"
  },
  "12": {
    "id": 13,
    "title": "Scientists discover new species of deep-sea fish",
    "news": "Scientists have discovered a new species of deep-sea fish living in the Mariana Trench, the deepest part of the world's oceans. The fish, named 'Mariana lanternfish', has bioluminescent organs that emit light to attract prey in the dark depths of the trench. The discovery sheds light on the biodiversity of deep-sea ecosystems.",
    "source": "National Geographic",
    "sourceURL": "https://www.nationalgeographic.com/",
    "imageURL": "https://example.com/image21.jpg",
    "publishDate": "11:45 pm on Tuesday, 12 March, 2024"
  },
  "13": {
    "id": 14,
    "title": "Apple unveils new MacBook Pro with M2 chip",
    "news": "Apple has unveiled its new MacBook Pro featuring the company's latest M2 chip, offering improved performance and efficiency compared to its predecessor. The new MacBook Pro comes with a redesigned chassis, a mini-LED display with ProMotion technology, and up to 32GB of RAM and 8TB of SSD storage.",
    "source": "Apple",
    "sourceURL": "https://www.apple.com/",
    "imageURL": "https://example.com/image14.jpg",
    "publishDate": "11:30 am on Monday, 11 March, 2024"
  },
  "14": {
    "id": 15,
    "title": "China announces plans to build 1,000 km/h 'super maglev' train",
    "news": "China has announced plans to build a 'super maglev' train capable of reaching speeds of up to 1,000 km/h (621 mph). The train, which will use magnetic levitation technology, aims to reduce travel time between cities and improve transportation efficiency. Construction is set to begin later this year.",
    "source": "China Daily",
    "sourceURL": "https://www.chinadaily.com.cn/",
    "imageURL": "https://example.com/image15.jpg",
    "publishDate": "3:00 pm on Sunday, 10 March, 2024"
  },
  "15": {
    "id": 16,
    "title": "EU unveils proposal for digital currency 'Eurocoin'",
    "news": "The European Union has unveiled a proposal for a digital currency called 'Eurocoin', aimed at reducing reliance on traditional payment systems and strengthening the euro's position in the global economy. Eurocoin would be issued by the European Central Bank and would complement existing cash and electronic payments.",
    "source": "European Commission",
    "sourceURL": "https://ec.europa.eu/",
    "imageURL": "https://example.com/image16.jpg",
    "publishDate": "9:45 am on Saturday, 9 March, 2024"
  },
  "16": {
    "id": 17,
    "title": "Netflix announces plans to expand into video games",
    "news": "Netflix has announced plans to expand into the video game industry, with the company set to offer a range of games to its subscribers at no additional cost. The move is part of Netflix's efforts to diversify its content offerings and attract new subscribers amid increasing competition in the streaming market.",
    "source": "Netflix",
    "sourceURL": "https://www.netflix.com/",
    "imageURL": "https://example.com/image17.jpg",
    "publishDate": "1:30 pm on Friday, 8 March, 2024"
  },
  "17": {
    "id": 18,
    "title": "SpaceX successfully launches Starlink-4 mission",
    "news": "SpaceX has successfully launched its Starlink-4 mission, deploying 60 Starlink satellites into orbit aboard a Falcon 9 rocket. The mission aims to expand SpaceX's Starlink internet constellation, which provides high-speed internet access to users around the world. The Falcon 9 booster successfully landed on a drone ship in the Atlantic Ocean.",
    "source": "SpaceX",
    "sourceURL": "https://www.spacex.com/",
    "imageURL": "https://example.com/image18.jpg",
    "publishDate": "10:00 am on Thursday, 7 March, 2024"
  },
  "18": {
    "id": 19,
    "title": "WHO declares new variant 'Theta' as a variant of concern",
    "news": "The World Health Organization (WHO) has declared a new variant of the coronavirus, named 'Theta', as a variant of concern. The variant, which was first detected in multiple countries, has raised concerns due to its potential to evade immunity and spread rapidly. WHO has urged countries to enhance surveillance and public health measures.",
    "source": "World Health Organization",
    "sourceURL": "https://www.who.int/",
    "imageURL": "https://example.com/image19.jpg",
    "publishDate": "8:15 am on Wednesday, 6 March, 2024"
  },
  "19": {
    "id": 20,
    "title": "Microsoft announces Windows 12 with AI-powered features",
    "news": "Microsoft has announced Windows 12, the latest version of its operating system, featuring AI-powered features designed to enhance productivity and security. Windows 12 will include features such as intelligent voice assistant, advanced threat protection, and enhanced multitasking capabilities.",
    "source": "Microsoft",
    "sourceURL": "https://www.microsoft.com/",
    "imageURL": "https://example.com/image20.jpg",
    "publishDate": "2:45 pm on Tuesday, 5 March, 2024"
  }
}
